marklysze/Magic-Pocket-Control-ESP32/src/main/main-m5stack-grey.cpp
#define USING_TFT_ESPI 0          // Not using the TFT_eSPI graphics library <-- must include this in every main file, 0 = not using, 1 = using
#define USING_M5GFX 0             // Using the M5GFX library with touch screen
#define USING_M5_BUTTONS 1        // Using the M5GFX library with the 3 buttons (buttons A, B, C)

#define OUTPUT_CAMERA_SETTINGS 1  // 1 = Outputs camera settings through serial (so other applications can read them)

// The output format is: >>[state]:[state value]
// Here are some examples:
/*
>>LensType:Canon EF-S 18-55mm f/3.5-5.6
>>LensIris:f3.5
>>FocalLengthMM:18mm
>>LensDistance:460mm to 590mm
>>ISO:3200
>>WhiteBalance:6500
>>Tint:10
>>Aperture:f3.5
>>ApertureNormalised:0
>>HasLens:Yes
>>FocalLengthMM:18
>>ModelName:Pocket Cinema Camera 6K
>>IsPocketCamera:Yes
>>FrameRate:25
>>FrameDims:4096 x 2160
>>FrameSize:4K DCI
>>ShutterAngle:6000
>>Codec:BRAW 12:1
*/

#include <ESP32-Chimera-Core.h>

#define tft M5.Lcd
static LGFX_Sprite *sprite;

#include <Arduino.h>
#include <string.h>

#include "Arduino_DebugUtils.h" // Debugging to Serial - https://github.com/arduino-libraries/Arduino_DebugUtils

// Main BMD Libraries
#include "Camera/ConstantsTypes.h"
#include "Camera/PacketWriter.h"
#include "CCU/CCUUtility.h"
#include "CCU/CCUPacketTypes.h"
#include "CCU/CCUValidationFunctions.h"
#include "Camera/BMDCameraConnection.h"
#include "Camera/BMDCamera.h"
#include "BMDControlSystem.h"

// Include the watchdog library so we can stop it timing out while pass key entry.
#include "esp_task_wdt.h"

// Lato font from Google Fonts
// Agency FB font is free for commercial use, copied from Windows fonts
// Rather than using font sizes, we use specific fonts for each size as it renders better on screen
#include "Fonts/Lato_Regular12pt7b.h" // Slightly larger version
#include "Fonts/Lato_Regular11pt7b.h" // Standard font
#include "Fonts/Lato_Regular6pt7b.h" // Small version for camera address
#include "Fonts/Lato_Regular5pt7b.h" // Smallest version
#include "Fonts/AgencyFB_Regular7pt7b.h" // Agency FB for tiny text
#include "Fonts/AgencyFB_Bold9pt7b.h" // Agency FB small for above buttons
#include "Fonts/AgencyFB_Regular9pt7b.h" // Agency FB small-medium for above buttons

// Screen width and height
#define IWIDTH 320
#define IHEIGHT 240

// Sprite width and height (limited by the lack of PSRAM on this device, Set to 8bpp, instead of 16bpp)
// We'll draw the side bar, the button labels, and the recording rectangle separately to the sprite
// Note: If you try to use a sprite that takes too much memory it may not show at all or Bluetooth will not connect properly
#define IWIDTH_SPRITE 320 // 300
#define IHEIGHT_SPRITE 240 // 208
#define BPP_SPRITE 8

// Sprites for Images
// Not using sprites to hold images as there's no PSRAM to store them and the main content sprite, so we'll just load them from other memory when required
/*
LGFX_Sprite spriteMPCSplash;
LGFX_Sprite spriteBluetooth;
LGFX_Sprite spritePocket4k;
LGFX_Sprite spriteWBBright;
LGFX_Sprite spriteWBCloud;
LGFX_Sprite spriteWBFlourescent;
LGFX_Sprite spriteWBIncandescent;
LGFX_Sprite spriteWBMixedLight;
LGFX_Sprite spriteWBBrightBG;
LGFX_Sprite spriteWBCloudBG;
LGFX_Sprite spriteWBFlourescentBG;
LGFX_Sprite spriteWBIncandescentBG;
LGFX_Sprite spriteWBMixedLightBG;
*/

// Images
#include "Images/MPCSplash-M5Stack-CoreS3.h"
#include "Images/ImageBluetooth.h"
#include "Images/ImagePocket4k.h"
#include "Images/WBBright.h"
#include "Images/WBCloud.h"
#include "Images/WBFlourescent.h"
#include "Images/WBIncandescent.h"
#include "Images/WBMixedLight.h"
#include "Images/WBBrightBG.h"
#include "Images/WBCloudBG.h"
#include "Images/WBFlourescentBG.h"
#include "Images/WBIncandescentBG.h"
#include "Images/WBMixedLightBG.h"

BMDCameraConnection cameraConnection;
std::shared_ptr<BMDControlSystem> BMDControlSystem::instance = nullptr; // Required for Singleton pattern and the constructor for BMDControlSystem
BMDCameraConnection* BMDCameraConnection::instancePtr = &cameraConnection; // Required for the scan function to run non-blocking and call the object back with the result

enum class Screens : byte
{
  PassKey = 9,
  NoConnection = 10,
  Dashboard = 100,
  Recording = 101,
  ISO = 102,
  ShutterAngleSpeed = 103,
  WhiteBalanceTintWB = 104, // Editing White Balance
  WhiteBalanceTintT = 124, // Editing Tint
  Codec = 105,
  Framerate = 106,
  Resolution = 107,
  Media = 108,
  Lens = 109,
  Slate = 110,
  Project = 111
};

Screens connectedScreenIndex = Screens::NoConnection; // The index of the screen we're on:
// 9 is Pass Key
// 10 is No Connection
// 100 is Dashboard
// 101 is Recording
// 102 is ISO
// 103 is Shutter Angle & Shutter Speed
// 104 is WB / Tint - Edit WB
// 105 is Codec
// 106 is Framerate
// 107 is Resolution (one for each camera group, 4K, 6K/G2/Pro, Mini Pro G2, Mini Pro 12K)
// 108 is Media
// 109 is Lens
// 124 is WB / Tint - Edit Tint

// Keep track of the last camera modified time that we refreshed a screen so we don't keep refreshing a screen when the camera object remains unchanged.
static unsigned long lastRefreshedScreen = 0;

// Button pressed indications for use in each individual page
bool btnAPressed = false;
bool btnBPressed = false;

// Display elements on the screen common to all pages
void Screen_Common(int sideBarColour)
{
    // DEBUG_DEBUG("Screen_Common");

    // Sidebar colour
    sprite->fillRect(0, 0, 13, IHEIGHT, sideBarColour);
    sprite->fillRect(13, 0, 2, IHEIGHT, TFT_DARKGREY);

    if(BMDControlSystem::getInstance()->hasCamera())
    {
      auto camera = BMDControlSystem::getInstance()->getCamera();

      sprite->setTextColor(TFT_WHITE);

      if(connectedScreenIndex == Screens::Dashboard)
      {
        // Dashboard Bottom Buttons
        sprite->fillSmoothRoundRect(30, 210, 80, 40, 3, TFT_DARKCYAN);
        sprite->drawCenterString("TBD", 70, 217, &AgencyFB_Bold9pt7b);

        if(camera->isRecording)
          sprite->fillSmoothCircle(IWIDTH / 2, 240, 30, TFT_RED);
        else
        {
          // Two outlines to make it a bit thicker
          sprite->drawCircle(IWIDTH / 2, 240, 30, TFT_RED);
          sprite->drawCircle(IWIDTH / 2, 240, 29, TFT_RED);
        }
      }
      else if(connectedScreenIndex == Screens::Recording)
      {
        // Recording Screen Bottom Buttons
        sprite->fillSmoothRoundRect(30, 210, 80, 40, 3, TFT_DARKCYAN);
        sprite->drawCenterString("TBD", 70, 217, &AgencyFB_Bold9pt7b);

        if(camera->isRecording)
          sprite->fillSmoothCircle(IWIDTH / 2, 240, 30, TFT_RED);
        else
        {
          // Two outlines to make it a bit thicker
          sprite->drawCircle(IWIDTH / 2, 240, 30, TFT_RED);
          sprite->drawCircle(IWIDTH / 2, 240, 29, TFT_RED);
        }
      }
      else
      {
        // Other Screens Bottom Buttons

        switch(connectedScreenIndex)
        {
          case Screens::ISO:
          case Screens::ShutterAngleSpeed:
          case Screens::WhiteBalanceTintT:
          case Screens::Codec:
          case Screens::Resolution:
          case Screens::Media:
          case Screens::Lens:
            sprite->fillSmoothRoundRect(30, 210, 170, 40, 3, TFT_DARKCYAN);
            sprite->fillTriangle(60, 235, 70, 215, 50, 215, TFT_WHITE); // Up Arrow
            sprite->fillTriangle(150, 235, 170, 235, 160, 215, TFT_WHITE); // Down Arrow
            break;
          case Screens::WhiteBalanceTintWB:
            // White Balance shows Presets or increment
            sprite->fillSmoothRoundRect(30, 210, 80, 40, 3, TFT_DARKCYAN);
            sprite->drawCenterString("PRESET", 70, 217, &AgencyFB_Bold9pt7b);

            sprite->fillSmoothRoundRect(120, 210, 80, 40, 3, TFT_DARKCYAN);
            sprite->drawCenterString("+100", 160, 217, &AgencyFB_Bold9pt7b);
            break;
        }
      }

