marklysze/Magic-Pocket-Control-ESP32/src/main/main-m5stack-grey.cpp
        if(index != -1)
          Options_ISO_SelectingIndex = index;
      }

      if(Options_ISO_SelectingIndex != -1)
      {
        Options_ISO_SelectingIndex = Options_ISO_SelectingIndex + (up ? 1 : -1); // Move the selected option

        if(Options_ISO_SelectingIndex < 0)
        {
          // Down button on the first option, go to the last option
          Options_ISO_SelectingIndex = Options_ISO.size() -1;
        }
        else if(Options_ISO_SelectingIndex > (Options_ISO.size() - 1))
        {
          // Up button on the last option, go to the first option
          Options_ISO_SelectingIndex = 0;
        }

        // ISO selected, send it to the camera
        PacketWriter::writeISO(Options_ISO[Options_ISO_SelectingIndex], &cameraConnection);

        tappedAction = true;
      }
    }
  }

  // If the screen hasn't changed, there were no touch events and we don't have to refresh, return.
  if(lastRefreshedScreen == camera->getLastModified() && !forceRefresh && !tappedAction)
    return;
  else
    lastRefreshedScreen = camera->getLastModified();
  
  DEBUG_DEBUG("Screen ISO Refreshed.");

  sprite->fillScreen(TFT_BLACK);

  Screen_Common_Connected(); // Common elements

  // M5GFX, set font here rather than on each drawString line
  sprite->setFont(&Lato_Regular11pt7b);

  // Get the current ISO value
  int currentISO = 0;
  if(camera->hasSensorGainISOValue())
    currentISO = camera->getSensorGainISOValue();

  // ISO label
  sprite->setTextColor(TFT_WHITE);
  sprite->drawString("ISO", 30, 9, &AgencyFB_Bold9pt7b);

  // sprite->textbgcolor = TFT_DARKGREY;

  // 200
  int labelISO = 200;
  sprite->fillSmoothRoundRect(20, 30, 90, 40, 3, (currentISO == labelISO ? TFT_DARKGREEN : TFT_DARKGREY));
  if(Options_ISO_SelectingIndex == 0) sprite->drawRoundRect(20, 30, 90, 40, 1, TFT_WHITE);
  sprite->drawCentreString(String(labelISO).c_str(), 65, 41);

  // 400
  labelISO = 400;
  sprite->fillSmoothRoundRect(115, 30, 90, 40, 3, (currentISO == labelISO ? TFT_DARKGREEN : TFT_DARKGREY));
  if(Options_ISO_SelectingIndex == 1) sprite->drawRoundRect(115, 30, 90, 40, 1, TFT_WHITE);
  sprite->drawCentreString(String(labelISO).c_str(), 160, 36);
  sprite->drawCentreString("NATIVE", 160, 59, &Lato_Regular5pt7b);

  // 8000
  labelISO = 8000;
  sprite->fillSmoothRoundRect(210, 30, 100, 40, 3, (currentISO == labelISO ? TFT_DARKGREEN : TFT_DARKGREY));
  if(Options_ISO_SelectingIndex == 6) sprite->drawRoundRect(210, 30, 100, 40, 1, TFT_WHITE);
  sprite->drawCentreString(String(labelISO).c_str(), 260, 41);

  // 640
  labelISO = 640;
  sprite->fillSmoothRoundRect(20, 75, 90, 40, 3, (currentISO == labelISO ? TFT_DARKGREEN : TFT_DARKGREY));
  if(Options_ISO_SelectingIndex == 2) sprite->drawRoundRect(20, 75, 90, 40, 1, TFT_WHITE);
  sprite->drawCentreString(String(labelISO).c_str(), 65, 87);

  // 800
  labelISO = 800;
  sprite->fillSmoothRoundRect(115, 75, 90, 40, 3, (currentISO == labelISO ? TFT_DARKGREEN : TFT_DARKGREY));
  if(Options_ISO_SelectingIndex == 3) sprite->drawRoundRect(115, 75, 90, 40, 1, TFT_WHITE);
  sprite->drawCentreString(String(labelISO).c_str(), 160, 87);

  // 12800
  labelISO = 12800;
  sprite->fillSmoothRoundRect(210, 75, 100, 40, 3, (currentISO == labelISO ? TFT_DARKGREEN : TFT_DARKGREY));
  if(Options_ISO_SelectingIndex == 7) sprite->drawRoundRect(210, 75, 100, 40, 1, TFT_WHITE);
  sprite->drawCentreString(String(labelISO).c_str(), 260, 87);

  // 1250
  labelISO = 1250;
  sprite->fillSmoothRoundRect(20, 120, 90, 40, 3, (currentISO == labelISO ? TFT_DARKGREEN : TFT_DARKGREY));
  if(Options_ISO_SelectingIndex == 4) sprite->drawRoundRect(20, 120, 90, 40, 1, TFT_WHITE);
  sprite->drawCentreString(String(labelISO).c_str(), 65, 131);

  // 3200
  labelISO = 3200;
  sprite->fillSmoothRoundRect(115, 120, 90, 40, 3, (currentISO == labelISO ? TFT_DARKGREEN : TFT_DARKGREY));
  if(Options_ISO_SelectingIndex == 5) sprite->drawRoundRect(115, 120, 90, 40, 1, TFT_WHITE);
  sprite->drawCentreString(String(labelISO).c_str(), 160, 126);
  sprite->drawCentreString("NATIVE", 160, 149, &Lato_Regular5pt7b);

  // Custom ISO - show if ISO is not one of the above values
  if(currentISO != 0)
  {
    // Only show the ISO value if it's not a standard one
    if(currentISO != 200 && currentISO != 400 && currentISO != 640 && currentISO != 800 && currentISO != 1250 && currentISO != 3200 && currentISO != 8000 && currentISO != 12800)
    {
      sprite->fillSmoothRoundRect(210, 120, 100, 40, 3, TFT_DARKGREEN);
      // sprite->textbgcolor = TFT_DARKGREEN;
      sprite->drawCentreString(String(currentISO).c_str(), 260, 126);
      sprite->drawCentreString("CUSTOM", 260, 149, &Lato_Regular5pt7b);
    }
  }

  sprite->pushSprite(0, 0);
}

void Screen_ShutterAngle(bool forceRefresh = false)
{
  if(!BMDControlSystem::getInstance()->hasCamera())
    return;

  connectedScreenIndex = Screens::ShutterAngleSpeed;

  auto camera = BMDControlSystem::getInstance()->getCamera();

  // If we have an up/down button press
  bool tappedAction = false;
  std::vector<int> Options_ShutterAngle = {1500, 6000, 9000, 12000, 15000, 18000, 27000, 36000}; // Values are X100
  int Options_ShutterAngle_SelectingIndex = -1; // when using up/down buttons keeps track of what option you are navigating to
  if(btnAPressed || btnBPressed)
  {
    DEBUG_DEBUG("Shutter Angle Screen: Btn A/B pressed");

    if(camera->hasShutterAngle()) // Ensure we have a value before allowing it to be changed
    {
      // Get the current Shutter Angle (comes through X100, so 180 degrees = 18000)
      int currentValue = camera->getShutterAngle();

      bool up = btnBPressed; // up = true, down = false

      // If we don't have a selected value yet, set to the current one
      if(Options_ShutterAngle_SelectingIndex == -1)
      {
        auto iter = std::find(Options_ShutterAngle.begin(), Options_ShutterAngle.end(), currentValue);
        int index = (iter != Options_ShutterAngle.end()) ? std::distance(Options_ShutterAngle.begin(), iter) : -1;

