marklysze/Magic-Pocket-Control-ESP32/src/main/main-m5stack-grey.cpp
        if(index != -1)
          Options_ShutterAngle_SelectingIndex = index;
        else // Custom Shutter Angle, use the latest one
        {
          int closestIndex = -1;
          int closestValue = std::numeric_limits<int>::min();  // Initialize with the lowest possible value

          for (int i = 0; i < Options_ShutterAngle.size(); ++i) {
              int optionValue = Options_ShutterAngle[i];

              if (optionValue <= currentValue && optionValue > closestValue) {
                  closestIndex = i;
                  closestValue = optionValue;
              }
          }

          if (closestIndex != -1)
          {
            if(up)
              Options_ShutterAngle_SelectingIndex = closestIndex; // Pressing up, closest one lower is right
            else
            {
              if(closestIndex < Options_ShutterAngle.size() - 1)
                Options_ShutterAngle_SelectingIndex = closestIndex + 1; // Pressing down, go up
              else
                Options_ShutterAngle_SelectingIndex = 0; // Already at the top, so go back to the start
            }
          }
          else // Lower than the lowest, so set to lowest in options
          {
            if(up)
              Options_ShutterAngle_SelectingIndex = Options_ShutterAngle.size() - 1; // Pressing up on a number lower than the lowest, put on the highest so we can go back around to the lowest in the set
            else
              Options_ShutterAngle_SelectingIndex = 0; // Otherwise pressing down and keep at the lowest and we'll be going to the highest
          }
        }
      }

      // Move to the next option and send it to the camera
      if(Options_ShutterAngle_SelectingIndex != -1)
      {
        Options_ShutterAngle_SelectingIndex = Options_ShutterAngle_SelectingIndex + (up ? 1 : -1); // Move the selected option

        if(Options_ShutterAngle_SelectingIndex < 0)
        {
          // Down button on the first option, go to the last option
          Options_ShutterAngle_SelectingIndex = Options_ShutterAngle.size() -1;
        }
        else if(Options_ShutterAngle_SelectingIndex > (Options_ShutterAngle.size() - 1))
        {
          // Up button on the last option, go to the first option
          Options_ShutterAngle_SelectingIndex = 0;
        }

        // Shutter Angle selected, send it to the camera
        PacketWriter::writeShutterAngle(Options_ShutterAngle[Options_ShutterAngle_SelectingIndex], &cameraConnection);

        tappedAction = true;
      }
    }
  }

  // If the screen hasn't changed, there were no touch events and we don't have to refresh, return.
  if(lastRefreshedScreen == camera->getLastModified() && !forceRefresh && !tappedAction)
    return;
  else
    lastRefreshedScreen = camera->getLastModified();
  
  DEBUG_DEBUG("Screen Shutter Angle Refreshed.");

  sprite->fillScreen(TFT_BLACK);

  Screen_Common_Connected(); // Common elements

  // Get the current Shutter Angle (comes through X100, so 180 degrees = 18000)
  int currentShutterAngle = 0;
  if(camera->hasShutterAngle())
    currentShutterAngle = camera->getShutterAngle();

  // Shutter Angle label
  sprite->setTextColor(TFT_WHITE);
  sprite->drawString("DEGREES", 265, 9, &AgencyFB_Regular7pt7b);
  sprite->drawString("SHUTTER ANGLE", 30, 9, &AgencyFB_Bold9pt7b);

  // 15
  int labelShutterAngle = 1500;
  sprite->fillSmoothRoundRect(20, 30, 90, 40, 3, (currentShutterAngle == labelShutterAngle ? TFT_DARKGREEN : TFT_DARKGREY));
  if(Options_ShutterAngle_SelectingIndex == 0) sprite->drawRoundRect(20, 30, 90, 40, 1, TFT_WHITE);
  sprite->drawCentreString(String(labelShutterAngle / 100).c_str(), 65, 41);

  // 60
  labelShutterAngle = 6000;
  sprite->fillSmoothRoundRect(115, 30, 90, 40, 3, (currentShutterAngle == labelShutterAngle ? TFT_DARKGREEN : TFT_DARKGREY));
  if(Options_ShutterAngle_SelectingIndex == 1) sprite->drawRoundRect(115, 30, 90, 40, 1, TFT_WHITE);
  sprite->drawCentreString(String(labelShutterAngle / 100).c_str(), 160, 41);

  // 90
  labelShutterAngle = 9000;
  sprite->fillSmoothRoundRect(210, 30, 100, 40, 3, (currentShutterAngle == labelShutterAngle ? TFT_DARKGREEN : TFT_DARKGREY));
  if(Options_ShutterAngle_SelectingIndex == 2) sprite->drawRoundRect(210, 30, 100, 40, 1, TFT_WHITE);
  sprite->drawCentreString(String(labelShutterAngle / 100).c_str(), 260, 41);

  // 120
  labelShutterAngle = 12000;
  sprite->fillSmoothRoundRect(20, 75, 90, 40, 3, (currentShutterAngle == labelShutterAngle ? TFT_DARKGREEN : TFT_DARKGREY));
  if(Options_ShutterAngle_SelectingIndex == 3) sprite->drawRoundRect(20, 75, 90, 40, 1, TFT_WHITE);
  sprite->drawCentreString(String(labelShutterAngle / 100).c_str(), 65, 87);

  // 150
  labelShutterAngle = 15000;
  sprite->fillSmoothRoundRect(115, 75, 90, 40, 3, (currentShutterAngle == labelShutterAngle ? TFT_DARKGREEN : TFT_DARKGREY));
  if(Options_ShutterAngle_SelectingIndex == 4) sprite->drawRoundRect(115, 75, 90, 40, 1, TFT_WHITE);
  sprite->drawCentreString(String(labelShutterAngle / 100).c_str(), 160, 87);

  // 180 (with a border around it)
  labelShutterAngle = 18000;
  sprite->fillSmoothRoundRect(210, 75, 100, 40, 3, (currentShutterAngle == labelShutterAngle ? TFT_DARKGREEN : TFT_DARKGREY));
  sprite->drawRoundRect(210, 75, 100, 40, 3, TFT_DARKGREEN);
  if(Options_ShutterAngle_SelectingIndex == 5) sprite->drawRoundRect(210, 75, 100, 40, 1, TFT_WHITE);
  sprite->drawCentreString(String(labelShutterAngle / 100).c_str(), 260, 87);

  // 270
  labelShutterAngle = 27000;
  sprite->fillSmoothRoundRect(20, 120, 90, 40, 3, (currentShutterAngle == labelShutterAngle ? TFT_DARKGREEN : TFT_DARKGREY));
  if(Options_ShutterAngle_SelectingIndex == 6) sprite->drawRoundRect(20, 120, 90, 40, 1, TFT_WHITE);
  sprite->drawCentreString(String(labelShutterAngle / 100).c_str(), 65, 131);

  // 360
  labelShutterAngle = 36000;
  sprite->fillSmoothRoundRect(115, 120, 90, 40, 3, (currentShutterAngle == labelShutterAngle ? TFT_DARKGREEN : TFT_DARKGREY));
  if(Options_ShutterAngle_SelectingIndex == 7) sprite->drawRoundRect(115, 120, 90, 40, 1, TFT_WHITE);
  sprite->drawCentreString(String(labelShutterAngle / 100).c_str(), 160, 131);

