marklysze/Magic-Pocket-Control-ESP32/src/main/main-m5stack-grey.cpp
  // 1/60
  labelShutterSpeed = 60;
  sprite->fillSmoothRoundRect(210, 30, 100, 40, 3, (currentShutterSpeed == labelShutterSpeed ? TFT_DARKGREEN : TFT_DARKGREY));
  sprite->drawCentreString("1/" + String(labelShutterSpeed), 260, 41);

  // 1/125
  labelShutterSpeed = 125;
  sprite->fillSmoothRoundRect(20, 75, 90, 40, 3, (currentShutterSpeed == labelShutterSpeed ? TFT_DARKGREEN : TFT_DARKGREY));
  sprite->drawCentreString("1/" + String(labelShutterSpeed), 65, 87);

  // 1/200
  labelShutterSpeed = 200;
  sprite->fillSmoothRoundRect(115, 75, 90, 40, 3, (currentShutterSpeed == labelShutterSpeed ? TFT_DARKGREEN : TFT_DARKGREY));
  sprite->drawCentreString("1/" + String(labelShutterSpeed), 160, 87);

  // 1/250
  labelShutterSpeed = 250;
  sprite->fillSmoothRoundRect(210, 75, 100, 40, 3, (currentShutterSpeed == labelShutterSpeed ? TFT_DARKGREEN : TFT_DARKGREY));
  sprite->drawCentreString("1/" + String(labelShutterSpeed), 260, 87);

  // 1/500
  labelShutterSpeed = 500;
  sprite->fillSmoothRoundRect(20, 120, 90, 40, 3, (currentShutterSpeed == labelShutterSpeed ? TFT_DARKGREEN : TFT_DARKGREY));
  sprite->drawCentreString("1/" + String(labelShutterSpeed), 65, 131);

  // 1/2000
  labelShutterSpeed = 2000;
  sprite->fillSmoothRoundRect(115, 120, 90, 40, 3, (currentShutterSpeed == labelShutterSpeed ? TFT_DARKGREEN : TFT_DARKGREY));
  sprite->drawCentreString("1/" + String(labelShutterSpeed), 160, 131);

  // Custom Shutter Speed - show if not one of the above values
  if(currentShutterSpeed != 0)
  {
    // Only show the Shutter Speed value if it's not a standard one
    if(currentShutterSpeed != 30 && currentShutterSpeed != 50 && currentShutterSpeed != 60 && currentShutterSpeed != 125 && currentShutterSpeed != 200 && currentShutterSpeed != 250 && currentShutterSpeed != 500 && currentShutterSpeed != 2000)
    {
      sprite->fillSmoothRoundRect(210, 120, 100, 40, 3, TFT_DARKGREEN);
      sprite->drawCentreString("1/" + String(currentShutterSpeed), 260, 126);
      sprite->drawCentreString("CUSTOM", 260, 149, &Lato_Regular5pt7b);
    }
  }

  sprite->pushSprite(0, 0);
}

void Screen_WBTint(bool editWB, bool forceRefresh = false) // editWB indicates editing White Balance when true, editing Tint when false
{
  if(!BMDControlSystem::getInstance()->hasCamera())
    return;

  connectedScreenIndex = editWB ? Screens::WhiteBalanceTintWB : Screens::WhiteBalanceTintT;

  auto camera = BMDControlSystem::getInstance()->getCamera();

  // White Balance and Tint
  // WB: Bright, Incandescent, Fluorescent, Mixed Light, Cloud

  // Get the current White Balance value
  int currentWB = 0;
  if(camera->hasWhiteBalance())
    currentWB = camera->getWhiteBalance();

  // Get the current Tint value
  int currentTint = 0;
  if(camera->hasTint())
    currentTint = camera->getTint();

  // If we have an up/down button press
  bool tappedAction = false;
  if((btnAPressed || btnBPressed) && camera->hasWhiteBalance() && camera->hasTint())
  {
    DEBUG_DEBUG("White Balance Screen: Btn A/B pressed");

    if(editWB) // White Balance Edit
    {
      if(btnAPressed)
      {
        // White Balance Presets

        std::vector<int> Options_WB = {5600, 3200, 4000, 4500, 6500};
        std::vector<int> Options_WB_Tint = {10, 0, 15, 15, 10}; // Corresponding Tints for WB presets
        int Options_WB_SelectingIndex = -1; // when using up/down buttons keeps track of what option you are navigating to

        // Get the current White Balance
        int currentValue = currentWB;

        bool up = true;

        // If we don't have a selected value yet, set to the current one
        if(Options_WB_SelectingIndex == -1)
        {
          auto iter = std::find(Options_WB.begin(), Options_WB.end(), currentValue);
          int index = (iter != Options_WB.end()) ? std::distance(Options_WB.begin(), iter) : -1;

          if(index != -1)
            Options_WB_SelectingIndex = index;
          else // Custom Shutter Speed, use the latest one
          {
            int closestIndex = -1;
            int closestValue = std::numeric_limits<int>::min();  // Initialize with the lowest possible value

            for (int i = 0; i < Options_WB.size(); ++i) {
                int optionValue = Options_WB[i];

                if (optionValue <= currentValue && optionValue > closestValue) {
                    closestIndex = i;
                    closestValue = optionValue;
                }
            }

            if (closestIndex != -1)
            {
              if(up)
                Options_WB_SelectingIndex = closestIndex; // Pressing up, closest one lower is right
              else
              {
                if(closestIndex < Options_WB.size() - 1)
                  Options_WB_SelectingIndex = closestIndex + 1; // Pressing down, go up
                else
                  Options_WB_SelectingIndex = 0; // Already at the top, so go back to the start
              }
            }
            else // Lower than the lowest, so set to lowest in options
            {
              if(up)
                Options_WB_SelectingIndex = Options_WB.size() - 1; // Pressing up on a number lower than the lowest, put on the highest so we can go back around to the lowest in the set
              else
                Options_WB_SelectingIndex = 0; // Otherwise pressing down and keep at the lowest and we'll be going to the highest
            }
          }
        }

        // Move to the next option and send it to the camera
        if(Options_WB_SelectingIndex != -1)
        {
          Options_WB_SelectingIndex = Options_WB_SelectingIndex + (up ? 1 : -1); // Move the selected option

          if(Options_WB_SelectingIndex < 0)
          {
            // Down button on the first option, go to the last option
            Options_WB_SelectingIndex = Options_WB.size() -1;
          }
          else if(Options_WB_SelectingIndex > (Options_WB.size() - 1))
          {
            // Up button on the last option, go to the first option
            Options_WB_SelectingIndex = 0;
          }

          // Shutter Speed selected, send it to the camera
          PacketWriter::writeWhiteBalance(Options_WB[Options_WB_SelectingIndex], Options_WB_Tint[Options_WB_SelectingIndex], &cameraConnection);

          tappedAction = true;
        }
      }
      else
      {
        // White Balance +100
        int newWB = currentWB + 100;

        if(newWB > 10000)
          newWB = 2500;

          // Shutter Speed selected, send it to the camera
          PacketWriter::writeWhiteBalance(newWB, currentTint, &cameraConnection);

          tappedAction = true;
      }
    }
    else if(!editWB && camera->hasTint())
    {
      std::vector<int> Options_Tint = {-50, -40, -30, -20, -15, -10, -9, -8, -7, -6, -5, -4, -3, -2, -1, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 15, 20, 30, 40, 50};
      int Options_Tint_SelectingIndex = -1; // when using up/down buttons keeps track of what option you are navigating to

      // Get the current Tint
      int currentValue = currentTint;

      bool up = btnBPressed; // up = true, down = false

      // If we don't have a selected value yet, set to the current one
      if(Options_Tint_SelectingIndex == -1)
      {
        auto iter = std::find(Options_Tint.begin(), Options_Tint.end(), currentValue);
        int index = (iter != Options_Tint.end()) ? std::distance(Options_Tint.begin(), iter) : -1;

