marklysze/Magic-Pocket-Control-ESP32/src/main/main-m5stack-grey.cpp
    if(currentRes == "4K DCI")
    {
      // Full sensor area only]
      sprite->fillSmoothRoundRect(20, 135, 90, 40, 3, TFT_DARKGREEN);
      sprite->drawCentreString("FULL", 65, 145);
    }
    else if(currentRes == "4K UHD")
    {
      // Full sensor area only]
      sprite->fillSmoothRoundRect(20, 135, 120, 40, 3, TFT_DARKGREEN);
      sprite->drawCentreString("WINDOW", 80, 145);
    }
    else
    {
      // HD

      // Scaled from Full, 2.6K or Windowed (however we can't tell which)
      sprite->fillSmoothRoundRect(20, 135, 290, 40, 3, TFT_DARKGREEN);
      sprite->drawCentreString("FULL / 2.6K / WINDOW", 165, 140);
      sprite->drawCentreString("CHECK/SET ON CAMERA", 165, 161, &Lato_Regular5pt7b);
    }
  }
  else
    DEBUG_ERROR("Resolution Pocket 4K - Codec not catered for.");

  sprite->pushSprite(0, 0);
}

// Resolution screen for Pocket 6K
void Screen_Resolution6K(bool forceRefresh = false)
{
  if(!BMDControlSystem::getInstance()->hasCamera())
    return;

  connectedScreenIndex = Screens::Resolution;

  auto camera = BMDControlSystem::getInstance()->getCamera();

  // Pocket 6K Resolution and Sensor Windows

  // Get the current Resolution and Codec
  CCUPacketTypes::RecordingFormatData currentRecordingFormat;
  if(camera->hasRecordingFormat())
    currentRecordingFormat = camera->getRecordingFormat();

  // Get the current Codec values
  CodecInfo currentCodec = camera->getCodec();

  // If we have a tap, we should determine if it is on anything
  /*
  bool tappedAction = false;
  if(tapped_x != -1)
  {
    if(currentCodec.basicCodec == CCUPacketTypes::BasicCodec::BRAW)
    {
      int width = 0;
      int height = 0;
      bool window = false;

      if(tapped_x >= 20 && tapped_y >= 30 && tapped_x <= 110 && tapped_y <= 70)
      {
        // 6K
        width = 6144; height = 3456;
      }
      else if(tapped_x >= 115 && tapped_y >= 30 && tapped_x <= 205 && tapped_y <= 70)
      {
        // 6K 2.4:1
        width = 6144; height = 2560;
        window = true;
      }
      else if(tapped_x >= 210 && tapped_y >= 30 && tapped_x <= 310 && tapped_y <= 70)
      {
        // 5.7K 17:9
        width = 5744; height = 3024;
        window = true;
      }

      else if(tapped_x >= 20 && tapped_y >= 75 && tapped_x <= 110 && tapped_y <= 115)
      {
        // 4K DCI
        width = 4096; height = 2160;
        window = true;
      }
      else if(tapped_x >= 115 && tapped_y >= 75 && tapped_x <= 205 && tapped_y <= 115)
      {
        // 3.7K Anamorphic
        width = 3728; height = 3104;
        window = true;
      }
      else if(tapped_x >= 210 && tapped_y >= 75 && tapped_x <= 310 && tapped_y <= 115)
      {
        // 2.8K 17:9
        width = 2868; height = 1512;
        window = true;
      }

      if(width != 0)
      {
        // Resolution selected, write to camera
        CCUPacketTypes::RecordingFormatData newRecordingFormat = currentRecordingFormat;
        newRecordingFormat.width = width;
        newRecordingFormat.height = height;
        newRecordingFormat.windowedModeEnabled = window;
        PacketWriter::writeRecordingFormat(newRecordingFormat, &cameraConnection);

        tappedAction = true;
      }
    }
    else
    {
      // ProRes

      int width = 0;
      int height = 0;
      bool window = false;

      String currentRes = currentRecordingFormat.frameDimensionsShort_string().c_str(); // "4K DCI", "4K UHD", "HD"

      if(tapped_x >= 20 && tapped_y >= 30 && tapped_x <= 110 && tapped_y <= 70)
      {
        // 4K
        width = 4096; height = 2160;
        window = true;
      }
      else if(tapped_x >= 115 && tapped_y >= 30 && tapped_x <= 205 && tapped_y <= 70)
      {
        // 4K UHD
        width = 3840; height = 2160;
        window = currentRecordingFormat.windowedModeEnabled;
      }
      else if(tapped_x >= 210 && tapped_y >= 30 && tapped_x <= 310 && tapped_y <= 70)
      {
        // HD
        width = 1920; height = 1080;
        window = currentRecordingFormat.windowedModeEnabled;
      }

      // Windowed options
      else if(currentRes == "4K UHD" && tapped_x >= 20 && tapped_y >= 120 && tapped_x <= 110 && tapped_y <= 160)
      {
        // 4K UHD - Full Sensor
        width = currentRecordingFormat.width; height = currentRecordingFormat.height;
        window = false;
      }
      else if(currentRes == "4K UHD" && tapped_x >= 115 && tapped_y >= 120 && tapped_x <= 205 && tapped_y <= 160)
      {
        // 4K UHD - Windowed 5.7K
        width = currentRecordingFormat.width; height = currentRecordingFormat.height;
        window = true;
      }
      else if(currentRes == "HD" && tapped_x >= 20 && tapped_y >= 120 && tapped_x <= 110 && tapped_y <= 160)
      {
        // HD - Full Sensor
        width = currentRecordingFormat.width; height = currentRecordingFormat.height;
        window = false;
      }
      else if(currentRes == "HD" && tapped_x >= 115 && tapped_y >= 120 && tapped_x <= 310 && tapped_y <= 160)
      {
        // HD - Scaled from 5.7K or 2.8K, can't distinguish which unfortunately
        width = currentRecordingFormat.width; height = currentRecordingFormat.height;
        window = true;
      }

      if(width != 0)
      {
        // Resolution or Sensor Area selected, write to camera
        CCUPacketTypes::RecordingFormatData newRecordingFormat = currentRecordingFormat;
        newRecordingFormat.width = width;
        newRecordingFormat.height = height;
        newRecordingFormat.windowedModeEnabled = window;
        PacketWriter::writeRecordingFormat(newRecordingFormat, &cameraConnection);

        tappedAction = true;
      }
    }
  }
  */

  // If the screen hasn't changed, there were no touch events and we don't have to refresh, return.
  if(lastRefreshedScreen == camera->getLastModified() && !forceRefresh)
  // if(lastRefreshedScreen == camera->getLastModified() && !forceRefresh && !tappedAction)
    return;
  else
    lastRefreshedScreen = camera->getLastModified();
  
  DEBUG_DEBUG("Screen Resolution Pocket 6K Refreshed.");

  sprite->fillScreen(TFT_BLACK);

  Screen_Common_Connected(); // Common elements

  if(currentCodec.basicCodec == CCUPacketTypes::BasicCodec::BRAW)
  {
    // Main label
    sprite->setTextColor(TFT_WHITE);
    sprite->drawString("BRAW RESOLUTION", 30, 9);

