marklysze/Magic-Pocket-Control-ESP32/src/main/main-m5stack-grey.cpp
}

void Screen_Lens(bool forceRefresh = false)
{
  if(!BMDControlSystem::getInstance()->hasCamera())
    return;

  connectedScreenIndex = Screens::Lens;

  auto camera = BMDControlSystem::getInstance()->getCamera();

  // If we have a tap, we should determine if it is on anything
  /*
  bool tappedAction = false;
  if(tapped_x != -1 && camera->hasTransportMode())
  {
    if(tapped_x >= 200 && tapped_y <= 120)
    {
      // Focus button
      PacketWriter::writeAutoFocus(&cameraConnection);

      DEBUG_DEBUG("Instantaneous Autofocus");
      
      tappedAction = true;
    }
  }
  */

  // If the screen hasn't changed, there were no touch events and we don't have to refresh, return.
  if(lastRefreshedScreen == camera->getLastModified() && !forceRefresh)
  // if(lastRefreshedScreen == camera->getLastModified() && !forceRefresh && !tappedAction)
    return;
  else
    lastRefreshedScreen = camera->getLastModified();

  DEBUG_DEBUG("Screen Lens Refreshed.");

  sprite->fillScreen(TFT_BLACK);

  Screen_Common_Connected(); // Common elements

  // M5GFX, set font here rather than on each drawString line
  sprite->setFont(&Lato_Regular11pt7b);

  // Focus button
  sprite->drawCircle(257, 63, 57, TFT_BLUE); // Outer
  sprite->fillSmoothCircle(257, 63, 54, TFT_SKYBLUE); // Inner
  sprite->setTextColor(TFT_WHITE);
  sprite->drawCentreString("FOCUS", 257, 50);

  if(camera->hasFocalLengthMM())
  {
    auto focalLength = camera->getFocalLengthMM();
    std::string focalLengthMM = std::to_string(focalLength);
    std::string combined = focalLengthMM + "mm";

    sprite->drawString(combined.c_str(), 30, 25, &Lato_Regular12pt7b);
  }

  if(camera->hasApertureFStopString())
  {
      sprite->drawString(camera->getApertureFStopString().c_str(), 30, 50, &Lato_Regular12pt7b);
  }

  sprite->pushSprite(0, 0);
}


void setup() {

  M5.begin();

  tft.setColorDepth(16);
  tft.setSwapBytes(true);

  tft.setTextDatum(TL_DATUM);
  tft.setTextPadding(tft.width());
  tft.setTextColor( TFT_WHITE);
  tft.setTextSize(1);
  tft.setFont(&Lato_Regular11pt7b);

  sprite = new LGFX_Sprite(&tft);
  sprite->setPsram(false);
  sprite->setColorDepth(BPP_SPRITE);
  sprite->setSwapBytes(true);
  sprite->setTextSize(1);
  sprite->setFont(&Lato_Regular11pt7b);


  /* To use Deep Sleep and use button B to wake up, the following code can be used.
      However, as the device won't maintain a connection while asleep, there isn't much point. Power button on the side can be used to shutdown.
      Power off: Quickly double-click the red power button on the left
      If you do want to go to deep sleep in your code, you can run the following code: esp_deep_sleep_start();

  pinMode(GPIO_NUM_38, INPUT_PULLUP); // Button B on M5Stack is GPIO 38, that's the one to wake up from sleep

  // Check if the ESP32 woke up from a deep sleep
  if (esp_sleep_get_wakeup_cause() == ESP_SLEEP_WAKEUP_EXT0) {
    Serial.begin(115200);
    Serial.println("Woke up from sleep!");
    // Additional actions can be performed here after waking up
  } else {
    Serial.begin(115200);
    Serial.println("First boot!");
    // Additional setup can be performed here on the first boot
  }
  // Configure wake-up source
  esp_sleep_enable_ext0_wakeup(GPIO_NUM_38, LOW);
  */

  // SET DEBUG LEVEL
  Debug.setDebugLevel(DBG_VERBOSE);
  Debug.timestampOn();

  // Allow a timeout of 30 seconds for time for the pass key entry. It's slower with buttons
  esp_task_wdt_init(35, true);

  // Splash screen
  tft.pushImage(0, 0, IWIDTH, IHEIGHT, MPCSplash_M5Stack_CoreS3);

  // Prepare for Bluetooth connections and start scanning for cameras
  cameraConnection.initialise(&tft, IWIDTH, IHEIGHT); // Screen Pass Key entry
}

int memoryLoopCounter;
bool forceRecordOutline = false; // Show the recording outline as we haven't done it yet

void loop() {

  dacWrite (25,0); // Silence the speaker as it sometimes makes high-pitched noise on screen refreshes: https://community.m5stack.com/topic/61/noise-on-speaker/16

  static unsigned long lastConnectedTime = 0;
  const unsigned long reconnectInterval = 5000;  // 5 seconds (milliseconds)

  unsigned long currentTime = millis();

  if ((cameraConnection.status == BMDCameraConnection::ConnectionStatus::Disconnected || cameraConnection.status == BMDCameraConnection::ConnectionStatus::FailedPassKey) && currentTime - lastConnectedTime >= reconnectInterval) {
    
    if(cameraConnection.status == BMDCameraConnection::ConnectionStatus::Disconnected)
      DEBUG_VERBOSE("Disconnected for too long, trying to reconnect");
    else
      DEBUG_VERBOSE("Failed Pass Key, trying to reconnect");

    // Set the status to Scanning and then show the NoConnection screen to render the Scanning page before starting the scan (which blocks so it can't render the Scanning page before it finishes)
    cameraConnection.status = BMDCameraConnection::ConnectionStatus::Scanning;
    Screen_NoConnection();

    cameraConnection.scan();

    if(connectedScreenIndex != Screens::NoConnection) // Move to the No Connection screen if we're not on it
      Screen_NoConnection();
  }
  else if(cameraConnection.status == BMDCameraConnection::ConnectionStatus::Connected)
  {
    auto camera = BMDControlSystem::getInstance()->getCamera();

    if(static_cast<byte>(connectedScreenIndex) >= 100)
    {
      // Check if the initial payload has been fully received and if it was after the camera's last modified time, update the camera's modified time
      if(cameraConnection.getInitialPayloadTime() != ULONG_MAX && cameraConnection.getInitialPayloadTime() > camera->getLastModified())
        camera->setLastModified();

      switch(connectedScreenIndex)
      {
        case Screens::Dashboard:
          Screen_Dashboard();
          break;
        case Screens::Recording:
          Screen_Recording();
          break;
        case Screens::ISO:
          Screen_ISO();
          break;
        case Screens::ShutterAngleSpeed:
          if(camera->shutterValueIsAngle)
            Screen_ShutterAngle();
          else
            Screen_ShutterSpeed();
          break;
        case Screens::WhiteBalanceTintWB:
        case Screens::WhiteBalanceTintT:
          Screen_WBTint(connectedScreenIndex == Screens::WhiteBalanceTintWB);
          break;
        case Screens::Codec:
          Screen_Codec();
          break;
        case Screens::Resolution:
          Screen_Resolution();
          break;
        case Screens::Media:
          Screen_Media();
          break;
        case Screens::Lens:
          Screen_Lens();
          break;
      }
    }
    else
      Screen_Dashboard(true); // Was on disconnected screen, now we're connected go to the dashboard

