marklysze/Magic-Pocket-Control-ESP32/src/main/main-m5stack-grey.cpp
    lastConnectedTime = currentTime;
  }
  else if(cameraConnection.status == BMDCameraConnection::ConnectionStatus::ScanningFound)
  {
    DEBUG_DEBUG("Cameras found!");

    cameraConnection.connect(cameraConnection.cameraAddresses[0]);

    if(cameraConnection.status == BMDCameraConnection::ConnectionStatus::FailedPassKey)
      DEBUG_DEBUG("Loop - Failed Pass Key");

    // Clear the screen so we can show the dashboard cleanly
    tft.fillScreen(TFT_BLACK);

    lastConnectedTime = currentTime;
  }
  else if(cameraConnection.status == BMDCameraConnection::ConnectionStatus::ScanningNoneFound)
  {
    DEBUG_VERBOSE("Status Scanning NONE Found. Marking as Disconnected.");
    cameraConnection.status = BMDCameraConnection::Disconnected;
    lastConnectedTime = currentTime;

    Screen_NoConnection();
  }

  // Keep track of the memory use to check that there aren't memory leaks (or significant memory leaks)
  /*
  if(Debug.getDebugLevel() >= DBG_VERBOSE && memoryLoopCounter++ % 400 == 0)
  {
    DEBUG_VERBOSE("Heap Size Free: %d of %d", ESP.getFreeHeap(), ESP.getHeapSize());
  }
  */

  // Buttons
  btnAPressed = false;
  btnBPressed = false;

  M5.update();

  if(M5.BtnA.wasPressed() || M5.BtnB.wasPressed() || M5.BtnC.wasPressed())
  {
    // Left button function changes on context
    // Only handle dashboard here
    if(M5.BtnA.wasPressed())
    {
      DEBUG_DEBUG("Button A");

      switch(connectedScreenIndex)
      {
        case Screens::Dashboard:
        case Screens::Recording:
        case Screens::ISO:
        case Screens::ShutterAngleSpeed:
        case Screens::WhiteBalanceTintWB:
        case Screens::WhiteBalanceTintT:
        case Screens::Codec:
        case Screens::Resolution:
        case Screens::Media:
        case Screens::Lens:
          // Indicate to the other screens the first button has been pressed
          btnAPressed = true;
          break;
      }
    }
    else if(M5.BtnB.wasPressed())
    {
      DEBUG_DEBUG("Button B");

      switch(connectedScreenIndex)
      {
        case Screens::Dashboard:
        case Screens::Recording:

          // RECORD START/STOP FOR DASHBOARD AND RECORDING SCREEN
          if(connectedScreenIndex == Screens::Dashboard || connectedScreenIndex == Screens::Recording)
          {
            // Do we have a camera instance created (happens when connected)
            if(BMDControlSystem::getInstance()->hasCamera())
            {
                // Get the camera instance so we can check the state of it
                auto camera = BMDControlSystem::getInstance()->getCamera();

                // Only hit record if we have the Transport Mode info (knowing if it's recording) and we're not already recording.
                if(camera->hasTransportMode())
                {
                    // Record button
                    DEBUG_VERBOSE("Record Start/Stop");

                    auto transportInfo = camera->getTransportMode();

                    if(!camera->isRecording)
                      transportInfo.mode = CCUPacketTypes::MediaTransportMode::Record;
                    else
                      transportInfo.mode = CCUPacketTypes::MediaTransportMode::Preview;

                    // Send the packet to the camera to start recording
                    PacketWriter::writeTransportInfo(transportInfo, &cameraConnection);
                }
            }
          }
          break;
        case Screens::ISO:
        case Screens::ShutterAngleSpeed:
        case Screens::WhiteBalanceTintWB:
        case Screens::WhiteBalanceTintT:
        case Screens::Codec:
        case Screens::Resolution:
        case Screens::Media:
        case Screens::Lens:
          // Indicate to the other screens the second button has been pressed
          btnBPressed = true;
          break;
      }
    }
    else if(M5.BtnC.wasPressed())
    {
      DEBUG_DEBUG("Button C > NEXT SCREEN");

      switch(connectedScreenIndex)
      {
        case Screens::Dashboard:
          connectedScreenIndex = Screens::Recording;
          break;
        case Screens::Recording:
          connectedScreenIndex = Screens::ISO;
          break;
        case Screens::ISO:
          connectedScreenIndex = Screens::ShutterAngleSpeed;
          break;
        case Screens::ShutterAngleSpeed:
          connectedScreenIndex = Screens::WhiteBalanceTintWB;
          break;
        case Screens::WhiteBalanceTintWB:
          connectedScreenIndex = Screens::WhiteBalanceTintT;
          break;
        case Screens::WhiteBalanceTintT:
          connectedScreenIndex = Screens::Codec;
          break;
        case Screens::Codec:
          connectedScreenIndex = Screens::Resolution;
          break;
        case Screens::Resolution:
          connectedScreenIndex = Screens::Media;
          break;
        case Screens::Media:
          connectedScreenIndex = Screens::Lens;
          break;
        case Screens::Lens:
          connectedScreenIndex = Screens::Dashboard;
          break;
      }

      lastRefreshedScreen = 0; // Forces a refresh
    }
  }

  delay(5);
}